Revit 2027 API
BuiltInFailures.CuttingFailures.UnableToReplaceWithLink Property
 Selected elements were copied to new file but Revit was unable to replace them with link to that file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToReplaceWithLink { get; }
Public Shared ReadOnly Property UnableToReplaceWithLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToReplaceWithLink {
	FailureDefinitionId^ get ();
}
static member UnableToReplaceWithLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace